Repository: Daniel-KM/Omeka-S-module-ArchiveRepertory
Catalog: language/*.po
Languages: fr

source: The module %1$s should be upgraded to version %2$s or later.
fr: Le module %1$s doit être mis à niveau à la version %2$s ou supérieure.

source: "Archive Repertory" module allows to save files in a hierarchical structure and to keep original name of files.
fr: Le module « Archive Repertory » permet d’enregistrer les fichiers dans une arborescence et de conserver les noms de fichiers originaux.

source: See %s for more information.
fr: Voir %s pour plus d’informations.

source: When all options are set, files will be saved in "files / original / item_set_identifier / item_identifier / original_filename.ext" instead of "files / original / hashed_filename.ext".
fr: Quand toutes les options sont choisies, les fichiers seront enregistrés dans « files / original / identifiant_collection / identifiant_item / fichier_original.ext » au lieu de « files / original / hashed_filename.ext ».

source: Currently, changes in these settings affect only new uploaded files. So, after a change, old files will continue to be stored and available as previously.
fr: Actuellement, les modifications des paramètres s’appliquent uniquement pour les nouveaux fichiers. Les anciens fichiers restent localisés au même endroit.

source: Nevertheless, when an item is updated, attached files will follow the current settings, so all files of a record will move and stay together inside the same folder.
fr: Néanmoins, quand un contenu est mis à jour, les fichiers attachés suivent les paramètres en cours et tous les fichiers d’'un contenu sont déplacés et restent ensemble dans le même dossier.

source: Currently, no check is done on the name of folders, either for items. No files will be lost if two folders have the same name, but files attached to a record will be mixed in this folder.
fr: Actuellement, aucune vérification n’est réalisée sur les noms de dossiers, ni pour les contenus. Aucun fichier ne sera perdu si deux dossiers ont le même nom, mais les fichiers attachés aux contenus seront placés ensemble dans le dossier.

source: Omeka works fine with filenames with Unicode characters ("é", "ñ", "Å"…).
fr: Omeka gère parfaitement les noms de fichiers avec des caractères Unicode (« é », « ñ », « Å »…).

source: If this is not the case, filenames should use only Ascii characters.
fr: Si ce n’est pas le cas, les noms de fichiers doivent utiliser seulement des caractères Ascii.

source: This server is compatible with Unicode.
fr: Ce serveur est compatible avec Unicode.

source: This server is not fully compatible with Unicode:
fr: Ce serveur n’est pas complètement compatible avec Unicode :

source: Use only an Ascii character as first character of your filenames or set the option "Convert first character of filename".
fr: Utilisez seulement un caractère Ascii comme première caractère de vos fichiers ou choisissez l’option « Convertir le premier caractère du nom de fichier ».

source: Usually, this is not a problem with this module and common modules.
fr: Généralement, ce n’est pas un problème avec ce module ou les modules courants.

source: But if you use a module that calls a program via the command line of the server, filenames issues can occur.
fr: Cependant, si vous utilisez un module qui appelle un programme via le terminal du serveur, des erreurs liées aux noms de fichiers peuvent survenir.

source: It is strongly recommanded to convert your filename to ascii.
fr: Il est recommandé de convertir les noms de fichiers en ascii.

source: If you choose to add a folder, Omeka will add subfolders for the %1$sfirst%2$s item set of each item in "files" folders, for example "files/original/item_set_identifier/".
fr: Si vous choisissez d’ajouter un dossier, Omeka choisira la %1$spremière%2$s collection de chaque contenu comme nom de sous-dossier, par exemple « files/original/identifiant_collection/ ».

source: New files will be stored inside them. Old files will be moved when item set will be updated.
fr: Les nouveaux fichiers sont enregistrés à l’intérieur. Les anciens fichiers sont déplacés quand la collection est mise à jour.

source: Note that if you choose a non unique name, files will be mixed in the same folder, with higher risk of name collision.
fr: Notez que si vous choisissez un nom non-unique, les fichiers seront mélangés dans le même dossier, avec un risque de collision plus élevé.

source: So recommended ids are a specific metadata, "Dublin Core:Identifier", "Internal resource id" and eventually "Dublin Core:Title".
fr: Il est donc recommandé d’utiliser une métadonnée spécifique comme identifiant : « Dublin Core : Identifiant », « Numéro de ressource interne » et éventuellement « Dublin Core : Titre ».

source: If this identifier does not exists, the Omeka internal item set id will be used.
fr: Si l’identifiant n’ existe pas, le numéro interne Omeka de la collection sera utilisé.

source: If you choose to add a folder, Omeka will add subfolders for each item in "files" folders, for example "files/original/unique_identifier/".
fr: Si vous choisissez d’ajouter un dossier, Omeka ajoutera des sous-dossiers pour chaque contenu dans les dossiers « files/ », par exemple « files/original/identifiant_unique/ ».

source: New files will be stored inside them. Old files will be moved when item will be updated.
fr: Les nouveaux fichiers sont enregistrés à l’intérieur. Les anciens fichiers sont déplacés quand le contenu est mis à jour.

source: So recommended ids are a specifc metadata, "Dublin Core Identifier", "Internal resource id" and eventually "Dublin Core Title".
fr: Il est donc recommandé d’utiliser une métadonnée spécifique comme identifiant : « Dublin Core Identifiant », « Numéro de ressource interne » et éventuellement « Dublin Core Titre ».

source: If this identifier does not exists, the Omeka internal item id will be used.
fr: Si l’identifiant n’existe pas, le numéro interne Omeka du contenu sera utilisé.

source: Files
fr: Fichiers

source: The process is now working with background processes.
fr: Le process fonctionne désormais également en arrière-plan.

source: This file is not present in the original directory: {filepath}. There was an undetected error before storage, probably during the convert process.
fr: Le fichier n’ est pas présent dans le dossier original : {filepath}. Une erreur inconnue est survenue avant l’enregistrement, probablement durant la conversion.

source: Cannot move files inside archive directory.
fr: Impossible de déplacer les fichiers dans l’arborescence.

source: Item set folder
fr: Dossier collection

source: Don’t add folder
fr: Ne pas ajouter de dossier

source: Internal numeric id of the resource
fr: Numéro interne de la ressource

source: Prefix for item sets
fr: Préfixes pour les collections

source: Choose a prefix, for example "item:", "record:" or "doc:", to select the appropriate metadata when they are multiple. Let empty to use simply the first one.
fr: Choisir un préfixe, par exemple « item: , « record: » ou « doc: », pour sélectionner la valeur correcte quand il y en a plusieurs. Laisser vide pour utiliser le premier.

source: Convert item set names
fr: Convertir les noms des collections

source: Item folder
fr: Dossier contenu

source: Convert item names
fr: Convertir les noms des contenus

source: Convert file names
fr: Convertir les noms de fichier

source: Hash filename (default Omeka)
fr: Brouiller le nom de fichier (défaut Omeka)

source: Keep parenthesis when sanitizing filename
fr: Conserver les parenthèses lors du nettoyage des noms de fichiers

source: This option is not recommended, because it is less secure and not url-compliant.
fr: Cette option est déconseillé, car elle moins sécurisée et non directement lisible dans les urls.

source: Depending on your server and your needs, to avoid some potential issues, you can choose or not to rename every folder to its Ascii equivalent (or only the first letter). In all cases, names are sanitized: "/", "\", "|" and other special characters are removed.
fr: En fonction de votre serveur et de vos besoins et pour éviter d’éventuels problèmes, vous pouvez choisir ou non de renommer chaque dossier en son équivalent Ascii (ou seulement la première lettre). Dans tous les cas, les noms sont nettoyés : « / », « \ », « | » et les autres caractères spéciaux sont supprimés.

source: Keep name as it (not recommended because your server is not fully compatible with Unicode)
fr: Conserver le nom tel quel (non recommandé, car votre serveur n’est pas complètement compatible avec Unicode)

source: Keep name as it
fr: Conserver le nom tel quel

source: Convert spaces to underscores
fr: Convertir les espaces en tirets bas

source: Convert first letter only
fr: Convertir la première lettre seulement

source: Convert first letter and spaces
fr: Convertir la première lettre et les espaces

source: Full conversion to Ascii (recommended because your server is not fully compatible with Unicode)
fr: Conversion complète en Ascii (recommandé, car votre serveur n’est pas complètement compatible avec Unicode)

source: Cannot move file "{file}" inside archive directory ("{dir}"): filepath longer than 190 characters.
fr: Impossible de déplacer le fichier « {file} » dans l’arborescence (« {dir} ») : le nom de fichier a plus de 190 caractères.

source: Cannot move file "{file}" inside archive directory: filepath longer than 190 characters.
fr: Impossible de déplacer le fichier « {file} » dans l’arborescence : le nom de fichier a plus de 190 caractères.

source: Cannot move file inside archive directory: no filename.
fr: Impossible de déplacer le fichier dans l’arborescence : pas de nom de fichier.

source: Unallowed resource type "{resource_name}".
fr: Type de ressource interdit « {resource_name} ».

source: Error directory non writeable: "{dir}".
fr: Erreur dossier fermé en écriture : « {dir} ».

source: Error making directory: "dir".
fr: Erreur lors de la création du dossier : « {dir} ».

source: Error during move of a file from "{source}" to "{destination}" (local dir: "{dir}"): source does not exist.
fr: Erreur lors du déplacement d’un fichier de « {source} » à « {destination} » (dossier local : « {dir} ») : la source n’existe pas.

source: Error during move of a file from "{source}" to "{destination}" (local dir: "{dir}").
fr: Erreur lors du déplacement d’un fichier de « {source} » à « {destination} » (dossier local : « {dir} »).

source: Missing thumbnails configuration
fr: Configuration des vignettes manquantes

source: Missing Archive Repertory ingesters configuration
fr: Configuration des ingéreurs manquante
